# Series Groupby
groupby() function is used to split the data into groups based on some criteria.

A groupby operation involves some combination of splitting the object, applying a function, and combining the results. This can be used to group large amounts of data and compute operations on these groups.

In [6]:
import pandas as pd
data = pd.Series([10, 20, 30, 40, 50], 
                 index = ['A', 'B', 'C', 'D', 'E'])
data['A'] = 45
data

A    45
B    20
C    30
D    40
E    50
dtype: int64

In [7]:
# data['A']
# data.keys()
# list(data.items())
# data['A':'D']
# data[0:4]
# data[['A', 'E']]

In [13]:
data[(data > 20) & (data < 50)]

A    45
C    30
D    40
dtype: int64

In [29]:
print(idata)
print(idata[3:6])         # implicit index without loc : also final index is excluded
print(idata.iloc[3:6])    # iloc works like implicit index so iloc is meant for implicit index preservation

1    a
3    b
4    c
5    d
6    e
7    f
dtype: object
5    d
6    e
7    f
dtype: object
5    d
6    e
7    f
dtype: object

## Data Selection in DataFrame

#### DataFrame as a dictionary

In [31]:
import pandas as pd

In [32]:
states_capitals = {'Karnataka':'Bangalore', 'Andrapradesh':'Hyderabad', 'Tamilnadu':'Chennai', 
                   'Keral':'Thiruvanathapuram', 'Maharastra':'Mumbai'}

In [33]:
states_lang = {'Karnataka':'Kannada', 'Andrapradesh':'Telugu', 'Tamilnadu':'Tamil', 'Kerala':'Malayalam', 
              'Maharastra':'hindi', 'Panjab':'Panjabi'}

In [34]:
data = pd.DataFrame({'capitals': states_capitals, 'language': states_lang})
data

                       capitals   language
Karnataka             Bangalore    Kannada
Andrapradesh          Hyderabad     Telugu
Tamilnadu               Chennai      Tamil
Keral         Thiruvanathapuram        NaN
Maharastra               Mumbai      hindi
Kerala                      NaN  Malayalam
Panjab                      NaN    Panjabi

In [35]:
data['capitals']

Karnataka               Bangalore
Andrapradesh            Hyderabad
Tamilnadu                 Chennai
Keral           Thiruvanathapuram
Maharastra                 Mumbai
Kerala                        NaN
Panjab                        NaN
Name: capitals, dtype: object

In [36]:
data.capitals

Karnataka               Bangalore
Andrapradesh            Hyderabad
Tamilnadu                 Chennai
Keral           Thiruvanathapuram
Maharastra                 Mumbai
Kerala                        NaN
Panjab                        NaN
Name: capitals, dtype: object

In [37]:
data['capitals'] is data.capitals

True

In [38]:
s_sub = pd.Series({'Pruthvi': 'Kannada', 'Pranam': 'Hindi', 'Pratham':'English', 'Pravera':'Maths', 'Prabu':'Science'})
total_m = pd.Series({'Pruthvi': 60, 'Pranam': 60, 'Pratham':60, 'Pravera':60, 'Prabu':60})
minf_m = pd.Series({'Pruthvi': 30, 'Pranam': 30, 'Pratham':30, 'Pravera':30, 'Prabu':30})
obt_m = pd.Series({'Pruthvi': 25, 'Pranam': 35, 'Pratham':40, 'Pravera':60, 'Prabu':55})

students_d = pd.DataFrame({'Sub' : s_sub, 'T_m' : total_m, 'Min_m' : minf_m, 'O_m' : obt_m})
students_d

             Sub  T_m  Min_m  O_m
Pruthvi  Kannada   60     30   25
Pranam     Hindi   60     30   35
Pratham  English   60     30   40
Pravera    Maths   60     30   60
Prabu    Science   60     30   55

In [39]:
students_d['score'] = students_d['O_m'] / students_d['T_m']
students_d

             Sub  T_m  Min_m  O_m     score
Pruthvi  Kannada   60     30   25  0.416667
Pranam     Hindi   60     30   35  0.583333
Pratham  English   60     30   40  0.666667
Pravera    Maths   60     30   60  1.000000
Prabu    Science   60     30   55  0.916667

In [40]:
students_d['mp_score'] = students_d['Min_m'] / students_d['T_m']
students_d

             Sub  T_m  Min_m  O_m     score  mp_score
Pruthvi  Kannada   60     30   25  0.416667       0.5
Pranam     Hindi   60     30   35  0.583333       0.5
Pratham  English   60     30   40  0.666667       0.5
Pravera    Maths   60     30   60  1.000000       0.5
Prabu    Science   60     30   55  0.916667       0.5

#### DataFrame as two-dimensional array

In [41]:
print(students_d)
students_d.values

             Sub  T_m  Min_m  O_m     score  mp_score
Pruthvi  Kannada   60     30   25  0.416667       0.5
Pranam     Hindi   60     30   35  0.583333       0.5
Pratham  English   60     30   40  0.666667       0.5
Pravera    Maths   60     30   60  1.000000       0.5
Prabu    Science   60     30   55  0.916667       0.5

array([['Kannada', 60, 30, 25, 0.4166666666666667, 0.5],
       ['Hindi', 60, 30, 35, 0.5833333333333334, 0.5],
       ['English', 60, 30, 40, 0.6666666666666666, 0.5],
       ['Maths', 60, 30, 60, 1.0, 0.5],
       ['Science', 60, 30, 55, 0.9166666666666666, 0.5]], dtype=object)

In [42]:
pd.DataFrame.T?

In [43]:
students_d.T

           Pruthvi    Pranam   Pratham Pravera     Prabu
Sub        Kannada     Hindi   English   Maths   Science
T_m             60        60        60      60        60
Min_m           30        30        30      30        30
O_m             25        35        40      60        55
score     0.416667  0.583333  0.666667     1.0  0.916667
mp_score       0.5       0.5       0.5     0.5       0.5

In [44]:
students_d.values[0]

array(['Kannada', 60, 30, 25, 0.4166666666666667, 0.5], dtype=object)

In [45]:
students_d.values[1]

array(['Hindi', 60, 30, 35, 0.5833333333333334, 0.5], dtype=object)

In [46]:
students_d['score']

Pruthvi    0.416667
Pranam     0.583333
Pratham    0.666667
Pravera    1.000000
Prabu      0.916667
Name: score, dtype: float64

In [47]:
students_d['T_m']

Pruthvi    60
Pranam     60
Pratham    60
Pravera    60
Prabu      60
Name: T_m, dtype: int64

In [48]:
students_d

             Sub  T_m  Min_m  O_m     score  mp_score
Pruthvi  Kannada   60     30   25  0.416667       0.5
Pranam     Hindi   60     30   35  0.583333       0.5
Pratham  English   60     30   40  0.666667       0.5
Pravera    Maths   60     30   60  1.000000       0.5
Prabu    Science   60     30   55  0.916667       0.5

In [49]:
students_d[1:3]

             Sub  T_m  Min_m  O_m     score  mp_score
Pranam     Hindi   60     30   35  0.583333       0.5
Pratham  English   60     30   40  0.666667       0.5

In [50]:
students_d['Pranam':'Pravera']

             Sub  T_m  Min_m  O_m     score  mp_score
Pranam     Hindi   60     30   35  0.583333       0.5
Pratham  English   60     30   40  0.666667       0.5
Pravera    Maths   60     30   60  1.000000       0.5

#### Accessing DF Objects Using loc, iloc, and ix

In [51]:
 pd.DataFrame.loc?

In [52]:
pd.DataFrame.iloc?

In [53]:
 pd.DataFrame.ix?

Object `pd.DataFrame.ix` not found.

In [54]:
print(students_d)

             Sub  T_m  Min_m  O_m     score  mp_score
Pruthvi  Kannada   60     30   25  0.416667       0.5
Pranam     Hindi   60     30   35  0.583333       0.5
Pratham  English   60     30   40  0.666667       0.5
Pravera    Maths   60     30   60  1.000000       0.5
Prabu    Science   60     30   55  0.916667       0.5

In [55]:
students_d.iloc[0:3, 0:2]

             Sub  T_m
Pruthvi  Kannada   60
Pranam     Hindi   60
Pratham  English   60

In [56]:
print(students_d)
students_d.iloc[2:5, 2:]

             Sub  T_m  Min_m  O_m     score  mp_score
Pruthvi  Kannada   60     30   25  0.416667       0.5
Pranam     Hindi   60     30   35  0.583333       0.5
Pratham  English   60     30   40  0.666667       0.5
Pravera    Maths   60     30   60  1.000000       0.5
Prabu    Science   60     30   55  0.916667       0.5

         Min_m  O_m     score  mp_score
Pratham     30   40  0.666667       0.5
Pravera     30   60  1.000000       0.5
Prabu       30   55  0.916667       0.5

In [57]:
print(students_d)
students_d.loc[:, :]

             Sub  T_m  Min_m  O_m     score  mp_score
Pruthvi  Kannada   60     30   25  0.416667       0.5
Pranam     Hindi   60     30   35  0.583333       0.5
Pratham  English   60     30   40  0.666667       0.5
Pravera    Maths   60     30   60  1.000000       0.5
Prabu    Science   60     30   55  0.916667       0.5

             Sub  T_m  Min_m  O_m     score  mp_score
Pruthvi  Kannada   60     30   25  0.416667       0.5
Pranam     Hindi   60     30   35  0.583333       0.5
Pratham  English   60     30   40  0.666667       0.5
Pravera    Maths   60     30   60  1.000000       0.5
Prabu    Science   60     30   55  0.916667       0.5

In [58]:
print(students_d)
students_d.loc[:'Pravera', 'O_m':]

             Sub  T_m  Min_m  O_m     score  mp_score
Pruthvi  Kannada   60     30   25  0.416667       0.5
Pranam     Hindi   60     30   35  0.583333       0.5
Pratham  English   60     30   40  0.666667       0.5
Pravera    Maths   60     30   60  1.000000       0.5
Prabu    Science   60     30   55  0.916667       0.5

         O_m     score  mp_score
Pruthvi   25  0.416667       0.5
Pranam    35  0.583333       0.5
Pratham   40  0.666667       0.5
Pravera   60  1.000000       0.5

In [59]:
print(students_d)
students_d.loc['Pranam':'Pravera', 'T_m':'score']

             Sub  T_m  Min_m  O_m     score  mp_score
Pruthvi  Kannada   60     30   25  0.416667       0.5
Pranam     Hindi   60     30   35  0.583333       0.5
Pratham  English   60     30   40  0.666667       0.5
Pravera    Maths   60     30   60  1.000000       0.5
Prabu    Science   60     30   55  0.916667       0.5

         T_m  Min_m  O_m     score
Pranam    60     30   35  0.583333
Pratham   60     30   40  0.666667
Pravera   60     30   60  1.000000

In [61]:
students_d.loc[students_d['O_m'] > 30, ['Min_m', 'O_m']]

         Min_m  O_m
Pranam      30   35
Pratham     30   40
Pravera     30   60
Prabu       30   55

In [62]:
print(students_d)
students_d.iloc[0, 3] = 30

             Sub  T_m  Min_m  O_m     score  mp_score
Pruthvi  Kannada   60     30   25  0.416667       0.5
Pranam     Hindi   60     30   35  0.583333       0.5
Pratham  English   60     30   40  0.666667       0.5
Pravera    Maths   60     30   60  1.000000       0.5
Prabu    Science   60     30   55  0.916667       0.5

In [63]:
students_d['score'] = students_d['O_m'] / students_d['T_m']
print(students_d)

             Sub  T_m  Min_m  O_m     score  mp_score
Pruthvi  Kannada   60     30   30  0.500000       0.5
Pranam     Hindi   60     30   35  0.583333       0.5
Pratham  English   60     30   40  0.666667       0.5
Pravera    Maths   60     30   60  1.000000       0.5
Prabu    Science   60     30   55  0.916667       0.5

In [1]:
import numpy as np
import pandas as pd
ser = pd.Series([390., 350., 30., 20.],
                index=['Falcon', 'Falcon', 'Parrot', 'Parrot'], 
                name="Max Speed")
ser

Falcon    390.0
Falcon    350.0
Parrot     30.0
Parrot     20.0
Name: Max Speed, dtype: float64

In [2]:
ser.groupby(["a", "a", "b", "b"]).mean()

a    370.0
b     25.0
Name: Max Speed, dtype: float64

In [3]:
# ser.rolling(window=2).sum()
# ser.expanding(min_periods = 2).sum()

## How To Group With Dictionaries and Series?

In [4]:
import numpy as np
import pandas as pd
rmlist = pd.DataFrame(np.random.randn(4, 5),
                       columns=['a', 'b', 'c', 'd', 'e'],
                       index=['one', 'two', 'three', 'four'])
rmlist

              a         b         c         d         e
one   -0.502430  0.764041  0.068039 -0.525335 -0.397654
two   -0.212525  0.859432  0.547427  0.472633  1.194026
three  1.530060  0.372251 -0.005658  0.410784  0.243698
four  -1.531949  0.575544  0.953617  0.497240 -2.473103

In [5]:
dic_map = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f' : 'orange'}
rmlist.groupby(by=dic_map, axis=1).sum()
#g_column.sum()

           blue       red
one   -0.457296 -0.136043
two    1.020060  1.840933
three  0.405125  2.146010
four   1.450857 -3.429508

In [6]:
pd.Series(dic_map)

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

#### How To Group With Functions?

In [7]:
rmlist.groupby(len).sum()

          a         b         c         d         e
3 -0.714954  1.623473  0.615466 -0.052702  0.796372
4 -1.531949  0.575544  0.953617  0.497240 -2.473103
5  1.530060  0.372251 -0.005658  0.410784  0.243698

In [8]:
key_list = ['one', 'one', 'one', 'two']
rmlist.groupby([len, key_list]).sum()

              a         b         c         d         e
3 one -0.714954  1.623473  0.615466 -0.052702  0.796372
4 two -1.531949  0.575544  0.953617  0.497240 -2.473103
5 one  1.530060  0.372251 -0.005658  0.410784  0.243698

In [9]:
key_list = ['one', 'two', 'three', 'four']
rmlist.groupby([len, key_list]).sum()

                a         b         c         d         e
3 one   -0.502430  0.764041  0.068039 -0.525335 -0.397654
  two   -0.212525  0.859432  0.547427  0.472633  1.194026
4 four  -1.531949  0.575544  0.953617  0.497240 -2.473103
5 three  1.530060  0.372251 -0.005658  0.410784  0.243698

#### How To Group by Index Level?

In [10]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'UK', 'RS', 'RS'],
                                    [1, 3, 5, 1, 3]],
                                    names=['city', 'tenor'])

hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

city         US                  UK        RS
tenor         1         3         5         1         3
0     -0.024206  0.171415 -0.563464 -0.125388 -0.205504
1     -0.443388  0.218368 -0.581747 -0.145068  0.581107
2     -1.311714  1.176629  0.967193 -0.551173  1.189095
3      0.977659 -0.305823  1.819245 -0.101508 -0.102798

In [11]:
hier_df.groupby(level='city', axis=1).count()

city  RS  UK  US
0      2   1   2
1      2   1   2
2      2   1   2
3      2   1   2

## Data Aggregation
Aggregations refer to any data transformation that produces scalar values from arrays. Some common aggregation methods are: (still you can find many methods, these are just to illustrate)
* count ,sum ,mean ,median ,std, var ,min, max ,prod ,first, last

In [12]:
book = pd.read_csv(r'input/books_discount.csv', encoding='latin')
book.head()

  book_name  price   author  min_dis  max_dis feedback
0       AAA    100  Author1      0.2      0.4     good
1       AAB    200  Author2      0.2      0.4  average
2       AAC    300  Author3      0.2      0.3     good
3       AAD    100  Author4      0.2      0.4     good
4       AAE    200  Author5      0.2      0.4  average

In [13]:
print(book['price'].min()); print(book['price'].max())

50
700

In [14]:
print(book['min_dis'].min()); print(book['max_dis'].min())

0.05
0.1

In [15]:
grouped = book.groupby(by=['feedback', 'author'], axis=0)

In [16]:
def max_min(arr):
    return arr.max(), arr.min()

grouped.agg(max_min)

                   book_name       price      min_dis      max_dis
feedback author
average  Author2  (AAS, AAB)  (500, 200)   (0.5, 0.1)  (0.55, 0.4)
         Author5  (AAK, AAE)  (500, 200)   (0.3, 0.2)  (0.4, 0.35)
good     Author1  (AAM, AAA)   (400, 50)   (0.3, 0.2)  (0.4, 0.35)
         Author3  (AAT, AAC)  (700, 200)  (0.3, 0.05)   (0.4, 0.1)
         Author4  (AAP, AAD)  (100, 100)   (0.3, 0.1)  (0.45, 0.3)
         Author6  (AAL, AAL)  (300, 300)   (0.4, 0.4)   (0.5, 0.5)

In [17]:
grouped.describe()

                 price                                                      \
                 count        mean         std    min    25%    50%    75%
feedback author
average  Author2   5.0  260.000000  134.164079  200.0  200.0  200.0  200.0
         Author5   2.0  350.000000  212.132034  200.0  275.0  350.0  425.0
good     Author1   3.0  183.333333  189.296945   50.0   75.0  100.0  250.0
         Author3   6.0  400.000000  200.000000  200.0  300.0  300.0  525.0
         Author4   3.0  100.000000    0.000000  100.0  100.0  100.0  100.0
         Author6   1.0  300.000000         NaN  300.0  300.0  300.0  300.0

                        min_dis            ...             max_dis            \
                    max   count      mean  ...    75%  max   count      mean
feedback author                            ...
average  Author2  500.0     5.0  0.280000  ...  0.400  0.5     5.0  0.460000
         Author5  500.0     2.0  0.250000  ...  0.275  0.3     2.0  0.375000
good     Author1  400.0     3.0  0.266667  ...  0.300  0.3     3.0  0.383333
         Author3  700.0     6.0  0.141667  ...  0.175  0.3     6.0  0.291667
         Author4  100.0     3.0  0.200000  ...  0.250  0.3     3.0  0.383333
         Author6  300.0     1.0  0.400000  ...  0.400  0.4     1.0  0.500000


                       std   min     25%    50%     75%   max
feedback author
average  Author2  0.065192  0.40  0.4000  0.450  0.5000  0.55
         Author5  0.035355  0.35  0.3625  0.375  0.3875  0.40
good     Author1  0.028868  0.35  0.3750  0.400  0.4000  0.40
         Author3  0.102062  0.10  0.3000  0.300  0.3375  0.40
         Author4  0.076376  0.30  0.3500  0.400  0.4250  0.45
         Author6       NaN  0.50  0.5000  0.500  0.5000  0.50

[6 rows x 24 columns]

#### How To Aggregate Column-wise and with Multiple Functions?

In [18]:
grouped = book.groupby(by=['feedback', 'author'])

In [19]:
grouped['price'].agg('min')

feedback  author
average   Author2    200
          Author5    200
good      Author1     50
          Author3    200
          Author4    100
          Author6    300
Name: price, dtype: int64

In [20]:
grouped['price'].agg('max')

feedback  author
average   Author2    500
          Author5    500
good      Author1    400
          Author3    700
          Author4    100
          Author6    300
Name: price, dtype: int64

In [21]:
grouped['price'].agg('mean')

feedback  author
average   Author2    260.000000
          Author5    350.000000
good      Author1    183.333333
          Author3    400.000000
          Author4    100.000000
          Author6    300.000000
Name: price, dtype: float64

In [22]:
grouped['price'].agg(['min', 'max', 'mean', 'std'])

                  min  max        mean         std
feedback author
average  Author2  200  500  260.000000  134.164079
         Author5  200  500  350.000000  212.132034
good     Author1   50  400  183.333333  189.296945
         Author3  200  700  400.000000  200.000000
         Author4  100  100  100.000000    0.000000
         Author6  300  300  300.000000         NaN

In [23]:
grouped['price'].agg([('min_value', 'min'), ('max_value', 'max'), 'mean', 'std'])

                  min_value  max_value        mean         std
feedback author
average  Author2        200        500  260.000000  134.164079
         Author5        200        500  350.000000  212.132034
good     Author1         50        400  183.333333  189.296945
         Author3        200        700  400.000000  200.000000
         Author4        100        100  100.000000    0.000000
         Author6        300        300  300.000000         NaN

In [24]:
functions = [('min_value', 'min'), ('max_value', 'max'), 'mean', 'std']
result = grouped['price', 'max_dis'].agg(functions)
result

/var/folders/9q/486czkcn7lv5v0hwbt71twdc0000gn/T/ipykernel_10707/4234575327.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  result = grouped['price', 'max_dis'].agg(functions)

                     price                                     max_dis  \
                 min_value max_value        mean         std min_value
feedback author
average  Author2       200       500  260.000000  134.164079      0.40
         Author5       200       500  350.000000  212.132034      0.35
good     Author1        50       400  183.333333  189.296945      0.35
         Author3       200       700  400.000000  200.000000      0.10
         Author4       100       100  100.000000    0.000000      0.30
         Author6       300       300  300.000000         NaN      0.50


                 max_value      mean       std
feedback author
average  Author2      0.55  0.460000  0.065192
         Author5      0.40  0.375000  0.035355
good     Author1      0.40  0.383333  0.028868
         Author3      0.40  0.291667  0.102062
         Author4      0.45  0.383333  0.076376
         Author6      0.50  0.500000       NaN

In [25]:
result['price']

                  min_value  max_value        mean         std
feedback author
average  Author2        200        500  260.000000  134.164079
         Author5        200        500  350.000000  212.132034
good     Author1         50        400  183.333333  189.296945
         Author3        200        700  400.000000  200.000000
         Author4        100        100  100.000000    0.000000
         Author6        300        300  300.000000         NaN

In [27]:
grouped = book.groupby(by=['feedback', 'author'], as_index=False).min()
grouped

  feedback   author book_name  price  min_dis  max_dis
0  average  Author2       AAB    200     0.10     0.40
1  average  Author5       AAE    200     0.20     0.35
2     good  Author1       AAA     50     0.20     0.35
3     good  Author3       AAC    200     0.05     0.10
4     good  Author4       AAD    100     0.10     0.30
5     good  Author6       AAL    300     0.40     0.50